Revit 2027 API
IPipePressureDropServer Methods
The IPipePressureDropServer type exposes the following members.
Methods
Name | Description
Calculate |  Calculate the pipe pressure drop.
GetDescription |  Implement this method to return a description of the server.
(Inherited from IExternalServer)
GetHtmlDescription |  The method that Revit will invoke to get an HTML formatted description of the server.
GetInformationLink |  The method that Revit will invoke to obtain a URL address which provides more information about the server.
GetName |  Implement this method to return the name of the server.
(Inherited from IExternalServer)
GetServerId |  Implement this method to return the id of the server.
(Inherited from IExternalServer)
GetServiceId |  Implement this method to return the id of the service.
(Inherited from IExternalServer)
GetVendorId |  Implement this method to return the id of the vendor of the server.
(Inherited from IExternalServer)
Top
See Also
Reference
IPipePressureDropServer Interface
Autodesk.Revit.DB.Plumbing Namespace